[{"publishedAt":"2021-06-17T21:16:38Z","author":"Emma Betuel","urlToImage":"https://techcrunch.com/wp-content/uploads/2021/06/GettyImages-1006988296.jpg?w=533","description":"This past year, three sheep in Canada have been wearing their kidneys on their sleeves. Or more aptly, in jackets on their fluffy backs.  These three sheep are part of an ongoing animal study run by the Buffalo, New York-based startup Qidni Labs, a company pu…","source":{"name":"TechCrunch","id":"techcrunch"},"title":"Mobile dialysis startup eyes human trials in 2022 following encouraging animal study","url":"http://techcrunch.com/2021/06/17/mobile-dialysis-startup-eyes-human-trials-in-2022-following-encouraging-animal-study/","content":"This past year, three sheep in Canadahave been wearing their kidneys on their sleeves. Or more aptly, in jackets on their fluffy backs. \r\nThese three sheep are part of an ongoing animal study run by … [+6112 chars]"},{"publishedAt":"2021-06-09T13:00:59Z","author":"Frederic Lardinois","urlToImage":"https://techcrunch.com/wp-content/uploads/2021/06/GettyImages-1175052081.jpg?w=711","description":"Commit, a Vancouver, Canada-based startup that has a unique approach to matching up engineers looking for a new job to early-stage startups that want to hire them, today announced that it has raised a $6 million seed round. Accomplice led the round, with part…","source":{"name":"TechCrunch","id":"techcrunch"},"title":"Commit raises $6M seed round to match senior engineers to startups they want to work for","url":"http://techcrunch.com/2021/06/09/commit-raises-6m-seed-round-to-match-senior-engineers-to-startups-they-want-to-work-for/","content":"Commit, a Vancouver, Canada-based startup that has a unique approach to matching up engineers looking for a new job to early-stage startups that want to hire them, today announced that it has raised … [+4086 chars]"},{"publishedAt":"2021-06-28T14:47:11Z","author":"Travis Bernard","urlToImage":"https://techcrunch.com/wp-content/uploads/2021/06/extra-crunch-july-4-2021.jpg?w=711","description":"From now until July 5th, we are offering 10% off annual Extra Crunch membership. This offer is valid for readers in the U.S., Canada, Europe, UK, and Israel. Claim the deal by navigating here. Extra Crunch is a membership program from TechCrunch that helps st…","source":{"name":"TechCrunch","id":"techcrunch"},"title":"Summer Sale: Save 10% on Extra Crunch membership","url":"http://techcrunch.com/2021/06/28/summer-sale-save-10-on-extra-crunch-membership/","content":"From now until July 5th, we are offering 10% off annual Extra Crunch membership. This offer is valid for readers in the U.S., Canada, Europe, UK, and Israel.\r\nClaim the deal by navigating here.\r\nExtr… [+1037 chars]"},{"publishedAt":"2021-06-07T10:15:05Z","author":"Ingrid Lunden","urlToImage":"https://techcrunch.com/wp-content/uploads/2020/06/GettyImages-1149449078-e1610399732853.jpg?w=760","description":"One of Google’s strong advantages in the world of online video has been the sheer size of YouTube: currently, the site has more than 2.3 billion monthly active users and over 500 hours of content uploaded every minute. Now, Google and YouTube are hoping to le…","source":{"name":"TechCrunch","id":"techcrunch"},"title":"YouTube expands TikTok rival Shorts to the UK, Canada, Latin America, lets users tap all of YouTube for tunes","url":"http://techcrunch.com/2021/06/07/youtube-expands-tiktok-rival-shorts-to-the-uk-canada-latin-america-lets-users-tap-all-of-youtube-for-tunes/","content":"One of Google’s strong advantages in the world of online video has been the sheer size of YouTube: currently, the site has more than 2.3 billion monthly active users and over 500 hours of content upl… [+4170 chars]"},{"publishedAt":"2021-06-09T17:21:00Z","author":"Reuters Staff","urlToImage":"https://s1.reutersmedia.net/resources_v2/images/rcom-default.png?w=800","description":"BRIEF-Canada considering whether to allow fully vaccinated citizens returning to Canada to avoid spending time in supervised quarantine facilities - health minister  Reuters","source":{"name":"Reuters","id":"reuters"},"title":"BRIEF-Canada considering whether to allow fully vaccinated citizens returning to Canada to avoid spending time in supervised quarantine facilities - health minister - Reuters","url":"https://www.reuters.com/article/brief-canada-considering-whether-to-allo-idUST5N2L7013","content":"By Reuters Staff\r\nJune 9 (Reuters) -\r\n* CANADA CONSIDERING WHETHER IT WILL ALLOW FULLY VACCINATED CITIZENS RETURNING TO CANADA TO AVOID SPENDING TIME IN SUPERVISED QUARANTINE FACILITIES - HEALTH MINI… [+556 chars]"}]