[{"publishedAt":"2021-07-01T09:51:15Z","author":"https://www.facebook.com/bbcnews","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/A271/production/_119158514_mediaitem119158513.jpg","description":"Lytton in British Columbia is evacuated a day after recording a temperature of 49.6C (121.3F).","source":{"name":"BBC News","id":"bbc-news"},"title":"Canada heatwave: Wildfire forces hottest place to evacuate","url":"https://www.bbc.co.uk/news/world-us-canada-57678054","content":"image captionWildfires were also spotted in Central Okanaga, British Columbia\r\nA wildfire has forced the evacuation of the Canadian village of Lytton a day after it recorded the country's highest eve… [+4607 chars]"},{"publishedAt":"2021-07-02T01:31:51Z","author":"https://www.facebook.com/bbcnews","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/5A93/production/_119178132_church.jpg","description":"The premier of Alberta says one of the targets was an African church attended by former refugees.","source":{"name":"BBC News","id":"bbc-news"},"title":"Ten churches vandalised in Alberta on Canada Day","url":"https://www.bbc.co.uk/news/world-us-canada-57690737","content":"image captionOne church in Calgary was daubed with paint\r\nTen churches have been vandalised in Alberta, Canada, in attacks that police have linked to anger over historic injustices against indigenous… [+2298 chars]"},{"publishedAt":"2021-06-07T08:28:24Z","author":"https://www.facebook.com/bbcnews","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/E454/production/_118825485_c115642b-ec83-4fe5-b1df-6f4faf61b802.jpg","description":"The depiction of Egerton Ryerson is toppled after a protest at his namesake university in Toronto.","source":{"name":"BBC News","id":"bbc-news"},"title":"Egerton Ryerson statue toppled at Canada indigenous school protest","url":"https://www.bbc.co.uk/news/world-us-canada-57381522","content":"image captionRyerson was influential in development of Ontario's public education system\r\nA statue has been toppled at Ryerson University in Toronto at a protest over the recent discovery of a mass g… [+2577 chars]"},{"publishedAt":"2021-07-02T16:15:49Z","author":"Story by Reuters","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/210702112523-queen-victoria-statue-toppled-0701-super-tease.jpg","description":"Protesters have toppled statues of Queen Victoria and Queen Elizabeth II in the Canadian city of Winnipeg as anger grows over the discovery of the remains of hundreds of children in unmarked graves at former indigenous schools.","source":{"name":"CNN","id":"cnn"},"title":"Statues of Queen Victoria, Queen Elizabeth toppled in Canada","url":"https://www.cnn.com/2021/07/02/americas/canada-queen-victoria-elizabeth-toppled-intl/index.html","content":"Winnipeg, CanadaProtesters have toppled statues of Queen Victoria and Queen Elizabeth II in the Canadian city of Winnipeg as anger grows over the discovery of the remains of hundreds of children in u… [+2362 chars]"},{"publishedAt":"2021-06-21T02:26:20Z","author":"By Rashard Rose, CNN","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/210621133615-peace-arch-border-crossing-super-tease.jpg","description":"The United States has extended Covid-19 restrictions on non-essential travel at land and ferry crossings with Canada and Mexico until July 21, according to a tweet from the Department of Homeland Security (DHS) on Sunday.","source":{"name":"CNN","id":"cnn"},"title":"US extends Covid-19 travel restrictions with Canada and Mexico","url":"https://www.cnn.com/travel/article/us-canada-mexico-covid-travel-restrictions-extended/index.html","content":"(CNN) The United States has extended Covid-19 restrictions on non-essential travel at land and ferry crossings with Canada and Mexico until July 21, according to a tweet from the Department of Homela… [+2295 chars]"}]