[{"publishedAt":"2021-07-03T18:00:47Z","author":"Sarah Perez","urlToImage":"https://s.yimg.com/uu/api/res/1.2/OBnX4Rv3sXK2pFWPeengkw--~B/aD03Mzg7dz0xMzkwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/techcrunch_350/d9c89c85e185eb51e976222ceeef092d","description":"<ol><li>This Week in Apps: iOS 15 public beta arrives, Android App Bundles to replace APKs, app consumer spend hits new record  Yahoo Movies Canada\r\n<\/li><li>These Nine Android Apps May Have Stolen Your Facebook Login Information  Gizmodo\r\n<\/li><li>Windows 11…","source":{"name":"Yahoo Entertainment","id":null},"title":"This Week in Apps: iOS 15 public beta arrives, Android App Bundles to replace APKs, app consumer spend hits new record - Yahoo Movies Canada","url":"https://ca.news.yahoo.com/week-apps-ios-15-public-180047952.html","content":"Welcome back to This Week in Apps, the weekly TechCrunch series that recaps the latest in mobile OS news, mobile applications and the overall app economy.\r\nThe app industry continues to grow, with a … [+23603 chars]"},{"publishedAt":"2021-07-02T11:14:00Z","author":"Allison Lampert","urlToImage":"https://www.reuters.com/resizer/JdwQkqLlk0FwVyBaWadCAGSZ3zg=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/4GGYHCRVWJIKNBC6VDGWZC7O6Y.jpg","description":"Downtown Montreal bars reeling from the loss of summer festivals and months of lockdowns due to the COVID-19 pandemic are seeing a windfall as the hockey mad city prepares to cheer on its beloved Canadiens on Friday in their first game on home ice of the Stan…","source":{"name":"Reuters","id":"reuters"},"title":"Montreal's pandemic-weary sports bars see relief with home team in Stanley Cup finals - Reuters","url":"https://www.reuters.com/lifestyle/sports/montreals-pandemic-weary-sports-bars-see-relief-with-home-team-stanley-cup-2021-07-02/","content":"MONTREAL, July 2 (Reuters) - Downtown Montreal bars reeling from the loss of summer festivals and months of lockdowns due to the COVID-19 pandemic are seeing a windfall as the hockey mad city prepare… [+3223 chars]"},{"publishedAt":"2021-06-10T18:12:46Z","author":"Nicole Einbinder","urlToImage":"https://i.insider.com/60bfe267a7202d0018b8dd3d?width=1200&format=jpeg","description":"Summary List PlacementThe Val Verde Unified School District, in the heart of Southern California's Inland Empire, isn't a bad place to get a public education, all things considered. It's not as well heeled as some of the wealthier Los Angeles exurbs to the we…","source":{"name":"Business Insider","id":"business-insider"},"title":"How an accused \"huckster\" and California's education czar sold America's public school system — and an inside track to the University of California — to the Chinese elite","url":"https://www.businessinsider.com/california-education-public-school-children-chinese-elite-colleges-2021-6","content":"The Val Verde Unified School District, in the heart of Southern California's Inland Empire, isn't a bad place to get a public education, all things considered. It's not as well heeled as some of the … [+74471 chars]"},{"publishedAt":"2021-06-07T19:55:00Z","author":"Megan Rowling","urlToImage":"https://s1.reutersmedia.net/resources_v2/images/rcom-default.png?w=800","description":"Pressure is growing on leaders of the G7 club of rich nations to provide more funding to deal with climate change and surplus COVID-19 vaccines for developing countries as an act of global solidarity when they meet this coming weekend in Britain.","source":{"name":"Reuters","id":"reuters"},"title":"G7 leaders urged to show solidarity on climate change and COVID-19 at summit - Reuters","url":"https://www.reuters.com/article/us-climate-change-g7-finance-idUSKCN2DJ2DZ","content":"BARCELONA (Thomson Reuters Foundation) - Pressure is growing on leaders of the G7 club of rich nations to provide more funding to deal with climate change and surplus COVID-19 vaccines for developing… [+4674 chars]"},{"publishedAt":"2021-06-27T00:01:29Z","author":"https://www.facebook.com/bbcnews","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/8A8D/production/_119096453_gettyimages-1252837424.jpg","description":"From Canada to Uganda, people are celebrating Pride, both as a protest for LGBT rights and as a party.","source":{"name":"BBC News","id":"bbc-news"},"title":"Pride month: Five stories from around the world","url":"https://www.bbc.co.uk/news/world-57604310","content":"image copyrightAFP via Getty Images\r\nimage captionPeople celebrate Pride in Montevideo, Uruguay in 2011\r\nIn many major cities around the world, Pride has gone mainstream. Municipal mayors march along… [+13130 chars]"}]