[{"publishedAt":"2021-06-08T09:23:38Z","author":"Arutz Sheva Staff","urlToImage":"https://u.a7.org/pictures/957/957789.jpg","description":"Pro-BDS activists in Canada falsify endorsements from three leading organizations for anti-Israel campaign.","source":{"name":"Israelnationalnews.com","id":null},"title":"Anti-Israel activists dupe Canadian medical student societies","url":"https://www.israelnationalnews.com/News/News.aspx/307688","content":"Anti-Israel activists in Canada falsified the endorsements of three leading medical student organizations last week, B’nai Brith Canada has reported.\r\nEarly last week, medical student societies at Ca… [+2853 chars]"},{"publishedAt":"2021-07-04T07:12:17Z","author":null,"urlToImage":"https://c.ndtvimg.com/2021-07/jvqoqffc_himachal-tourists-pti-650_625x300_04_July_21.jpg","description":"Tourists have been thronging Himachal Pradesh as the heatwave has hit the plains and the second wave of COVID-19 seeing a significant decline in the country.","source":{"name":"NDTV News","id":null},"title":"Tourists Throng Himachal As Plains Reel Under Heatwave, Covid Cases Decline","url":"https://www.ndtv.com/india-news/tourists-throng-himachal-as-plains-reel-under-heatwave-covid-cases-decline-2478875","content":"Himachal Pradesh: The surge in tourism has posed a challenge to ensure adhering of Covid protocols.\r\nShimla: Tourists have been thronging Himachal Pradesh as the heatwave has hit the plains and the s… [+3397 chars]"},{"publishedAt":"2021-06-22T14:58:13Z","author":"Colin Perkel","urlToImage":"https://www.ctvnews.ca/polopoly_fs/1.5480655.1624374556!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg","description":"<ol><li>'Time doesn't heal the pain:' Keep killer Paul Bernardo behind bars, families say  CTV News\r\n<\/li><li>Notorious killer and rapist Paul Bernardo to attend parole hearing today  CP24 Toronto's Breaking News\r\n<\/li><li>Toronto's Morning Headlines; Bernard…","source":{"name":"Ctvnews.ca","id":null},"title":"'Time doesn't heal the pain:' Keep killer Paul Bernardo behind bars, families say - CTV News","url":"https://www.ctvnews.ca/canada/time-doesn-t-heal-the-pain-keep-killer-paul-bernardo-behind-bars-families-say-1.5480350","content":"TORONTO -- \r\nRelatives of two teens raped, tortured and killed by Paul Bernardo recounted the enduring pain of his crimes at his second parole hearing on Tuesday as they warned he should never be rel… [+3632 chars]"},{"publishedAt":"2021-07-03T08:00:00Z","author":"CBC Radio","urlToImage":"https://i.cbc.ca/1.5631975.1624659032!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/nb-canada-day-parade-20190628.jpg","description":"On this week’s show: A special edition of The House examines the state of Canada’s federal system. Experts debate and dive deep into issues of governance, the climate crisis, education and the response to the COVID-19 pandemic. Plus — two departing MPs, Liber…","source":{"name":"CBC News","id":"cbc-news"},"title":"CBC Radio's The House: A federation under strain","url":"https://www.cbc.ca/radio/thehouse/the-house-july-3-1.6084882","content":"Making federalism work for Canada\r\nIn this special episode of The House, experts discuss whether Canada's federal system is able to handle big crises and how the country has handled the COVID-19 pand… [+1426 chars]"},{"publishedAt":"2021-06-11T14:03:26Z","author":"The Economist","urlToImage":"https://www.economist.com/img/b/1280/720/90/sites/default/files/images/print-edition/20210619_TQP095_0.jpg","description":"EVERY FEW weeks from June 1963 until July 1968, Robert Paine, a zoologist, made the journey from Seattle, where he taught at the University of Washington, across Puget Sound to the rocky shores of Mukkaw bay. There, he had found virtually pristine tide pools …","source":{"name":"The Economist","id":null},"title":"Compared with climate, modelling of ecosystems is at an early stage","url":"https://www.economist.com/technology-quarterly/2021/06/19/compared-with-climate-modelling-of-ecosystems-is-at-an-early-stage","content":"EVERY FEW weeks from June 1963 until July 1968, Robert Paine, a zoologist, made the journey from Seattle, where he taught at the University of Washington, across Puget Sound to the rocky shores of Mu… [+11601 chars]"}]