[{"publishedAt":"2021-06-28T04:00:00Z","author":null,"urlToImage":"https://www.eurekalert.org/multimedia/pub/web/269222_web.jpg","description":"(Picower Institute at MIT) The RPB Walt and Lilly Disney Award for Amblyopia Research will support efforts to develop a new therapeutic approach to the common vision disorder.","source":{"name":"EurekAlert","id":null},"title":"Mark F. Bear earns RPB amblyopia research award","url":"https://www.eurekalert.org/pub_releases/2021-06/piam-mfb062821.php","content":"Research to Prevent Blindness (RPB) has granted Picower Professor Mark F. Bear a $100,000 RPB Walt and Lilly Disney Award for Amblyopia Research to support his work on a potential treatment for the d… [+2282 chars]"},{"publishedAt":"2021-06-06T17:58:25Z","author":"Jairam Ramesh","urlToImage":"https://www.thehindu.com/books/b3s0mk/article34746692.ece/ALTERNATES/LANDSCAPE_615/LighOfAsiajpg","description":"An ardent Indophile’s poem on the life of Buddha stirred a rethink on conventional ideas of a philosophy","source":{"name":"The Hindu","id":"the-hindu"},"title":"Embedded in Ambedkar’s historiography","url":"https://www.thehindu.com/opinion/lead/embedded-in-ambedkars-historiography/article34746605.ece","content":"Published in London in July 1879, The Light of Asia by Sir Edwin Arnold, a poem on the life and teachings of the Buddha, contributed greatly to the international communitys knowledge of Buddhism and … [+5644 chars]"},{"publishedAt":"2021-06-26T09:15:30Z","author":"Nebal Snan, Local Journalism Initiative Reporter - The Chronicle Herald","urlToImage":"https://www.thestar.com/assets/img/thestar-ribbon.png","description":"About two years of uncertainty could be finally coming to an end for Chourouk Halloul and her family.","source":{"name":"Toronto Star","id":null},"title":"Canada lifts travel restrictions for prospective permanent residents, but some remain in limbo","url":"https://www.thestar.com/news/canada/2021/06/26/canada-lifts-travel-restrictions-for-prospective-permanent-residents-but-some-remain-in-limbo.html","content":"About two years of uncertainty could be finally coming to an end for Chourouk Halloul and her family. \r\nThe family of three will finally be able to land in Canada after the country opened its borders… [+5366 chars]"},{"publishedAt":"2021-06-07T06:00:00Z","author":"Alexander Wong","urlToImage":"https://nationalinterest.org/sites/default/files/main_images/Convo1.jpg","description":"Alexander Wong\nCoronavirus, Canada\n \nEvidence is mounting to support a mixing and matching approach with AstraZeneca followed by Pfizer being at least as good (if not better) than giving two doses of the same vaccine.\nPeople in Canada whose first dose of COVI…","source":{"name":"The National Interest ","id":null},"title":"AstraZeneca Second Dose: Should I Get The Same Vaccine or Choose Pfizer or Moderna?","url":"https://nationalinterest.org/blog/reboot/astrazeneca-second-dose-should-i-get-same-vaccine-or-choose-pfizer-or-moderna-186950","content":"People in Canada whose first dose of COVID-19 vaccine was AstraZeneca have a choice to make: They can either choose one of the mRNA vaccines (Pfizer or Moderna) or another dose of AstraZeneca for the… [+8056 chars]"},{"publishedAt":"2021-06-09T12:27:07Z","author":null,"urlToImage":"https://c.ndtvimg.com/2020-06/9mh2gif8_pregnancy-650_650x400_23_June_20.jpg","description":"A population-based study, published in the Journal of the American Medical Association (JAMA), has found flu vaccination during pregnancy does not lead to an increased risk of adverse early childhood health outcomes.","source":{"name":"NDTV News","id":null},"title":"No Risk For Kids Born To Mothers Given Flu Jabs During Pregnancy: Study","url":"https://www.ndtv.com/world-news/influenza-vaccine-no-risk-for-children-born-to-mothers-given-flu-jabs-during-pregnancy-study-2460072","content":"Safety concerns are a reason people may not get influenza jabs during pregnancy (Representational)\r\nOttawa: A population-based study, published in the Journal of the American Medical Association (JAM… [+2152 chars]"}]