[{"publishedAt":"2021-06-17T21:27:24Z","author":"Vernon Ramesar","urlToImage":"https://i.cbc.ca/1.6070143.1623964302!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/covid-briefing.jpg","description":"Premier Iain Rankin said Nova Scotia was not given advance notice that New Brunswick would be reopening its borders to the rest of Canada.","source":{"name":"CBC News","id":"cbc-news"},"title":"Nova Scotia caught off guard by New Brunswick border reopening","url":"https://www.cbc.ca/news/canada/nova-scotia/nova-scotia-new-brunswick-border-reopening-cautious-1.6069869","content":"Nova Scotia Premier Iain Rankin said he found out about neighbouring New Brunswick's decision to open its borders to the rest of Canada effective Thursday the same time everyone else did.\r\nNew Brunsw… [+3403 chars]"},{"publishedAt":"2021-06-10T13:00:06Z","author":"Evan Radford, Local Journalism Initiative Reporter, Regina Leader-Post - The Leader-Post","urlToImage":"https://www.thestar.com/assets/img/thestar-ribbon.png","description":"If there was a time to follow the oft-used phrase about placing proverbial eggs in many baskets, former farmer Tim Shultz figures year one of the COVI...","source":{"name":"Toronto Star","id":null},"title":"State of Agriculture: Pandemic pushes local Sask. foods","url":"https://www.thestar.com/news/canada/2021/06/10/state-of-agriculture-pandemic-pushes-local-sask-foods.html","content":"If there was a time to follow the oft-used phrase about placing proverbial eggs in many baskets, former farmer Tim Shultz figures year one of the COVID-19 pandemic was it. \r\nThe Regina business owner… [+5945 chars]"},{"publishedAt":"2021-06-23T22:44:00Z","author":"Emma Teitel - City Columnist","urlToImage":"https://images.thestar.com/MC_Qa3PJiBp1OEvSDf9eOXnoxeI=/1200x911/smart/filters:cb(1624488254028)/https://www.thestar.com/content/dam/thestar/news/gta/2021/06/23/so-you-got-pfizer-first-and-moderna-second-thats-ok-experts-say-your-body-doesnt-recognize-brand-names/dolly_parton.jpg","description":"Doctors are racking their brains for analogies to convince people that mixing vaccines is safe. This has got to stop, says Emma Teitel. The important part is to get two doses without delay. Mix and match Pfizer and Moderna if that’s what’s available to you.","source":{"name":"Toronto Star","id":null},"title":"Emma Teitel: So you got Pfizer first and Moderna second? That’s OK, experts say: your body doesn’t recognize brand names","url":"https://www.thestar.com/news/gta/2021/06/23/so-you-got-pfizer-first-and-moderna-second-thats-ok-experts-say-your-body-doesnt-recognize-brand-names.html","content":"Has anything been analogized more than the Pfizer and Moderna vaccines? At a news conference Wednesday morning, the city’s top doctor, Eileen de Villa, reassured Torontonians that both mRNA vaccines … [+4953 chars]"},{"publishedAt":"2021-06-11T14:32:07Z","author":"The Conversation","urlToImage":"https://smartcdn.prod.postmedia.digital/nationalpost/wp-content/uploads/2021/06/AZ.jpg","description":"<ol><li>AstraZeneca second dose: Should I get it again or choose Pfizer or Moderna vaccine?  National Post\r\n<\/li><li>Canada to commit to sharing up to 100 million COVID-19 vaccine doses  CBC.ca\r\n<\/li><li>Canada to share up to 100M COVID-19 vaccine doses with …","source":{"name":"National Post","id":null},"title":"AstraZeneca second dose: Should I get it again or choose Pfizer or Moderna vaccine? - National Post","url":"https://nationalpost.com/news/canada/astrazeneca-second-dose-should-i-get-it-again-or-choose-pfizer-or-moderna-vaccine","content":"There is no clinical efficacy data for mixing and matching vaccines, such as clinical trials or real-world studies. So, some may prefer receiving two doses of AstraZeneca \r\nAlexander Wong, University… [+11658 chars]"},{"publishedAt":"2021-06-12T08:00:00Z","author":"Adam Miller","urlToImage":"https://i.cbc.ca/1.6063329.1623452246!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/covid-ont-hockey-rink-mass-vaccine-20210604.jpg","description":"Canada is poised to battle back more contagious coronavirus variants that threaten to jeopardize reopening plans across the country due to a huge uptick in vaccine supply, a willingness from Canadians to get the shots and some promising new vaccine research.","source":{"name":"CBC News","id":"cbc-news"},"title":"How Canada can crush the variants with vaccines and make this reopening our last","url":"https://www.cbc.ca/news/health/canada-vaccines-variants-covid-19-1.6063282","content":"This is an excerpt from Second Opinion, a weekly roundup of health and medical science news emailed to subscribers every Saturday morning. If you haven't subscribed yet, you can do that by clicking h… [+8448 chars]"}]