[{"publishedAt":"2021-06-22T18:14:01Z","author":"The Canadian Press","urlToImage":"https://smartcdn.prod.postmedia.digital/nationalpost/wp-content/uploads/2014/07/paul-bernardo.jpg","description":"<ol><li>Teen killer and serial rapist Paul Bernardo again denied parole  National Post\r\n<\/li><li>Victims' families describe pain, grief before Paul Bernardo denied parole a 2nd time  CBC.ca\r\n<\/li><li>Here's why teen killer and rapist Paul Bernardo was denied …","source":{"name":"National Post","id":null},"title":"Teen killer and serial rapist Paul Bernardo again denied parole - National Post","url":"https://nationalpost.com/news/canada/cp-newsalert-teen-killer-and-serial-rapist-paul-bernardo-again-denied-parole","content":"The parole board took about an hour before denying Bernardo release, saying they were not persuaded that he no longer posed a substantive risk of reoffending \r\nPaul Bernardo leaves a Kingston Court a… [+7483 chars]"},{"publishedAt":"2021-07-04T07:43:14Z","author":"PTI","urlToImage":"https://images.indianexpress.com/2021/07/Shimla-1200.jpg","description":"Shimla Hotel and Restaurant Association president Sanjay Sood said the withdrawal of the condition of negative RTPCR report and e-covid pass to enter Himachal Pradesh recently has given a boost to the tourism industry of the state.","source":{"name":"The Indian Express","id":null},"title":"Tourists throng Himachal as heatwave hits plains, Covid wave slows down","url":"https://indianexpress.com/article/india/tourists-throng-himachal-as-heatwave-hits-plains-covid-wave-slows-down-7388446/","content":"Tourists have been thronging Himachal Pradesh as the heatwave has hit the plains and the second wave of COVID-19 seeing a significant decline in the country. People from the plains are visiting touri… [+3273 chars]"},{"publishedAt":"2021-06-23T20:00:36Z","author":"Kate Lyons","urlToImage":"https://i.guim.co.uk/img/media/aa0522872d3e6d499e9e4fe1ee300d69e2dc5f3c/0_507_4000_2399/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=fe763510273bf5637af7bd31d2a6d079","description":"Miners are pushing hard to extract metals from the ocean floor, but there is mounting concern about what it might do to the marine environmentTravel thousands of metres below the surface of the ocean, and you reach the seabed. Pitch black and quiet, it is lar…","source":{"name":"The Guardian","id":null},"title":"Mining’s new frontier: Pacific nations caught in the rush for deep-sea riches","url":"https://amp.theguardian.com/world/2021/jun/23/minings-new-frontier-pacific-nations-caught-in-the-rush-for-deep-sea-riches","content":"Travel thousands of metres below the surface of the ocean, and you reach the seabed. Pitch black and quiet, it is largely unexplored, untouched, unknown.\r\nWhat is known is extraordinary. The landscap… [+14997 chars]"},{"publishedAt":"2021-06-28T05:00:00Z","author":"Katrina Lane","urlToImage":"https://www.springwise.com/wp-content/uploads/2021/06/innovationsustainabilityrecycled-plastic-dustbins.png","description":"WorkshopQ is on a mission to re-think the waste around us and turn it into attractive, artistic designs\nThe post Design studio creates dustbins made from recycled plastic in India appeared first on Springwise.","source":{"name":"Springwise.com","id":null},"title":"Design studio creates dustbins made from recycled plastic in India","url":"https://www.springwise.com/innovation/sustainability/recycled-plastic-dustbins","content":"Spotted: Sustainable design startup WorkshopQ has designed and created 27 dustbins in India using recycled plastic. The initiative aims to support Nestle Indias Hilldaari programme, which focuses on … [+2116 chars]"},{"publishedAt":"2021-06-11T08:40:55Z","author":"Priya Yadav. Sputnik International","urlToImage":"https://cdn2.img.sputniknews.com/images/07e5/06/0b/1083124583.jpg","description":"Dalhousie, is a town spread over five hills near the Dhauladhar mountain range, in the Chamba district of the state of Himachal Pradesh. It is famous for its spectacular natural beauty, nestled deep in the Himalayas at an altitude of 6,460 feet and offers a s…","source":{"name":"Sputnik International","id":null},"title":"British-Era Name of Popular Mountain Retreat in India's Himachal Splits Bharatiya Janata Party","url":"https://sputniknews.com/india/202106111083123977-british-era-name-of-popular-mountain-retreat-in-indias-himachal-splits-bharatiya-janata-party/","content":"Dalhousie, is a town spread over five hills near the Dhauladhar mountain range, in the Chamba district of the state of Himachal Pradesh. It is famous for its spectacular natural beauty, nestled deep … [+3519 chars]"}]