[{"publishedAt":"2021-06-06T17:13:44Z","author":"Michael Powell","urlToImage":"https://static01.nyt.com/images/2021/06/02/us/00ACLU-1/merlin_184310484_f50ff0bd-746f-4b61-af5f-e084a16ab7cd-facebookJumbo.jpg","description":"An organization that has defended the First Amendment rights of Nazis and the Ku Klux Klan is split by an internal debate over whether supporting progressive causes is more important.","source":{"name":"New York Times","id":null},"title":"Once a Bastion of Free Speech, the A.C.L.U. Faces an Identity Crisis","url":"https://www.nytimes.com/2021/06/06/us/aclu-free-speech.html","content":"That may be an overstatement. Mr. Wizner, who runs the A.C.L.U.s free speech project, has represented the National Security Agency whistle-blower Edward Snowden and rattled off important cases his la… [+1924 chars]"},{"publishedAt":"2021-06-17T11:00:00Z","author":"Khari Johnson","urlToImage":"","description":"Language models like GPT-3 can write poetry, but they often amplify negative stereotypes. Researchers are trying different approaches to address the problem.","source":{"name":"Wired","id":"wired"},"title":"The Efforts to Make Text-Based AI Less Racist and Terrible","url":"https://www.wired.com/story/efforts-make-text-ai-less-racist-terrible/","content":"In another test, Xudong Shen, a National University of Singapore PhD student, rated language models based on how much they stereotype people by gender or whether they identify as queer, transgender, … [+4534 chars]"},{"publishedAt":"2021-06-11T09:00:11Z","author":"Nina Reyes","urlToImage":"https://static01.nyt.com/images/2021/06/13/fashion/00CapiloutoHarb/00CapiloutoHarb-facebookJumbo.jpg","description":"As they got to know each other better, Emily Capilouto and Dr. James Harb realized they had more similarities than differences.","source":{"name":"New York Times","id":null},"title":"Their Essential Interest in Common Was Each Other","url":"https://www.nytimes.com/2021/06/11/style/emily-capilouto-james-harb-wedding.html","content":"On paper, Emily Capilouto and Dr. James Harb didnt seem to have much in common when they connected through the dating app Bumble in 2018 and agreed to meet for a first date in Birmingham, Ala., where… [+1066 chars]"},{"publishedAt":"2021-06-11T14:41:02Z","author":"Sam Roberts","urlToImage":"https://static01.nyt.com/images/2021/06/12/obituaries/12Clinger-obit/10Clinger-facebookJumbo.jpg","description":"A nine-term Pennsylvania Republican, he oversaw investigations into the so-called Travelgate and Filegate matters. The Clintons were exonerated in both.","source":{"name":"New York Times","id":null},"title":"William Clinger Jr., 92, Dies; Led House Inquiries on Clinton","url":"https://www.nytimes.com/2021/06/11/us/politics/william-f-clinger-jr-dead.html","content":"In October 2016, weeks before the general election, he was one of about 30 former Republican legislators who declared in a public letter that Mr. Trump was manifestly unqualified to be president.\r\nWi… [+1120 chars]"},{"publishedAt":"2021-06-11T11:00:00Z","author":"Grace Huckins","urlToImage":"https://media.wired.com/photos/60c15cf2c99dc8c320fb6cf3/191:100/w_1280,c_limit/Science-Brain-Neuron-Rhythm-151037916.jpg","description":"Researchers have found evidence in humans that individual neurons time their firing to a deeper beat. But there’s a mystery: What does it mean?","source":{"name":"Wired","id":"wired"},"title":"A New Way to Understand the Brain's Intricate Rhythm","url":"https://www.wired.com/story/a-new-way-to-understand-the-brains-intricate-rhythm/","content":"Today, when researchers spend long hours in the lab performing tricky experiments, they might listen to music or podcasts to get them through the day. But in the early years of neuroscience, hearing … [+3566 chars]"}]