[{"publishedAt":"2021-06-05T22:54:54Z","author":"https://www.facebook.com/bbcnews","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/16DD3/production/_118815639_hi067853029.jpg","description":"Opponents say a Chinese university in the Hungarian capital could increase Beijing's influence.","source":{"name":"BBC News","id":"bbc-news"},"title":"Budapest protest against China's Fudan University campus","url":"https://www.bbc.co.uk/news/world-europe-57372653","content":"image captionDemonstrators marched through the streets of Budapest in protest against plans to build a Chinese university in the city\r\nThousands of people marched through Budapest to protest against … [+2345 chars]"},{"publishedAt":"2021-06-28T16:49:39Z","author":"Brian Heater","urlToImage":"https://techcrunch.com/wp-content/uploads/2021/06/Tepper_School_of_Business-yellow.jpg?w=600","description":"The math is simple: Great research universities beget great startups. Pittsburgh certainly has little want for the former, with two world-class research schools — Carnegie Mellon University and the University of Pittsburgh – located in the city. The latter hi…","source":{"name":"TechCrunch","id":"techcrunch"},"title":"How Carnegie Mellon is helping build its own startups and keeping them in Pittsburgh","url":"http://techcrunch.com/2021/06/28/how-cmu-is-helping-build-its-own-startups-and-keeping-them-in-pittsburgh/","content":"The math is simple: Great research universities beget great startups. Pittsburgh certainly has little want for the former, with two world-class research schools — Carnegie Mellon University and the U… [+5744 chars]"},{"publishedAt":"2021-06-10T08:16:33Z","author":"Tage Kene-Okafor","urlToImage":"https://techcrunch.com/wp-content/uploads/2021/06/greenscreen_final2-1.00_00_00_00.Still001.jpg?w=758","description":"Two profound problems face the higher education sector globally — affordability and relevance. Whether you live in Africa, Europe, or the U.S., a major reason why people don’t go to university or college or even drop out because they cannot afford tuition fee…","source":{"name":"TechCrunch","id":"techcrunch"},"title":"Nexford University lands $10.8M pre-Series A to scale its flexible remote learning platform","url":"http://techcrunch.com/2021/06/10/nexford-university-lands-10-8m-pre-series-a-to-scale-its-flexible-remote-learning-platform/","content":"Two profound problems face the higher education sector globally — affordability and relevance. Whether you live in Africa, Europe, or the U.S., a major reason why people don’t go to university or col… [+8285 chars]"},{"publishedAt":"2021-06-08T16:41:07Z","author":"Matt Burns","urlToImage":"https://techcrunch.com/wp-content/uploads/2021/06/jahanian_853x480-min.jpeg?w=711","description":"TechCrunch is thrilled to announce Carnegie Mellon University President Farnam Jahanian is speaking at our Pittsburgh event on June 29. You can register here. It’s free to participate and hear President Farnam’s interview. President Jahanian is an outspoken a…","source":{"name":"TechCrunch","id":"techcrunch"},"title":"Carnegie Mellon University President Farnam Jahanian is speaking at TechCrunch City Spotlight: Pittsburgh","url":"http://techcrunch.com/2021/06/08/carnegie-mellon-university-president-farnam-jahanian-is-speaking-at-techcrunch-city-spotlight-pittsburgh/","content":"TechCrunch is thrilled to announce Carnegie Mellon University President Farnam Jahanian is speaking at our Pittsburgh event on June 29. You can register here. It’s free to participate and hear Presid… [+2416 chars]"},{"publishedAt":"2021-06-22T20:37:19Z","author":"Mike Baker","urlToImage":"https://static01.nyt.com/images/2021/06/21/us/uwpolice-web1/uwpolice-web1-facebookJumbo.jpg","description":"Police officers at the University of Washington in Seattle, regarded as one of the nation’s most progressive cities, said they were the target of racist insults and harassment.","source":{"name":"New York Times","id":null},"title":"University of Washington Police Officers File Racism Claims","url":"https://www.nytimes.com/2021/06/22/us/uw-police-racism.html","content":"In Seattle, the descriptions of overt racism inside the campus police department stand out in a city that proudly touts its efforts to combat racism, and where Black Lives Matter signs can be seen in… [+2686 chars]"}]