[{"publishedAt":"2021-06-30T22:08:13Z","author":"David Folkenflik","urlToImage":"https://media.npr.org/assets/img/2021/06/30/nhj-at-peabodies_wide-f8faea20800bb2621b10dfeb84abdb410b0c949a.jpg?s=1400","description":"The University of North Carolina at Chapel Hill's trustees' earlier refusal to take up her case inspired a bruising national debate over race, journalism and academic freedom.","source":{"name":"NPR","id":null},"title":"After Contentious Debate, UNC Grants Tenure To Nikole Hannah-Jones","url":"https://www.npr.org/2021/06/30/1011880598/after-contentious-debate-unc-grants-tenure-to-nikole-hannah-jones","content":"Nikole Hannah-Jones accepting a Peabody Award in May 2016.\r\nMike Coppola/Getty Images \r\nTrustees for the University of North Carolina at Chapel Hill voted Wednesday afternoon at a closed session to g… [+4074 chars]"},{"publishedAt":"2021-06-28T16:00:00Z","author":"Matt Simon","urlToImage":"https://media.wired.com/photos/60d5f9a6a069f13cc7c034c4/191:100/w_1280,c_limit/science_fiberoptic_541379892.jpg","description":"Vibrations from cars and pedestrians create unique signals in cables. Now scientists have used the trick to show how Covid-19 brought life to a halt.","source":{"name":"Wired","id":"wired"},"title":"How Underground Fiber Optics Spy on Humans Moving Above","url":"https://www.wired.com/story/how-underground-fiber-optics-spy-on-humans-moving-above/","content":"When last springs lockdown quieted the Penn State campus and surrounding town of State College, a jury-rigged instrument was listening. A team of researchers from the university had tapped into an un… [+3564 chars]"},{"publishedAt":"2021-06-15T16:56:28Z","author":"Scott Neuman","urlToImage":"https://media.npr.org/assets/img/2021/06/14/gettyimages-1322590538_wide-7acd18aff271dc1dd1bbbc7c60f496d8bc398602.jpg?s=1400","description":"The latest toll from Johns Hopkins University comes nearly four months after the nation crossed the half-million mark for deaths from the coronavirus pandemic.","source":{"name":"NPR","id":null},"title":"The U.S. Has Hit 600,000 COVID Deaths, More Than Any Other Country","url":"https://www.npr.org/sections/coronavirus-live-updates/2021/06/15/1006186695/the-u-s-has-hit-600-000-covid-deaths-more-than-any-other-country","content":"Memorials hang from the front gate of Greenwood Cemetery during an event and procession organized by Naming the Lost Memorials to remember and celebrate the lives of those killed by the COVID-19 pand… [+2555 chars]"},{"publishedAt":"2021-06-19T13:30:00Z","author":"Elizabeth Yuko","urlToImage":"https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/46dc6ecad08f57fc3fe95b46e2a1b1f8.jpg","description":"Some decisions require a lot of thought—weighing pros and cons, and trying to reach the best possible outcome. But some people are indecisive about pretty much everything, big or small. Whether you’re dealing with an ambivalent person, or you are an ambivalen…","source":{"name":"Lifehacker.com","id":null},"title":"How Being Ambivalent Can Help You Make Better Decisions","url":"https://lifehacker.com/how-being-ambivalent-can-help-you-make-better-decisions-1847133403","content":"Some decisions require a lot of thoughtweighing pros and cons, and trying to reach the best possible outcome. But some people are indecisive about pretty much everything, big or small. Whether youre … [+1808 chars]"},{"publishedAt":"2021-07-03T11:51:14Z","author":"jzitser@businessinsider.com (Joshua Zitser)","urlToImage":"https://i.insider.com/60e04d037cd04c001a227cc0?width=1200&format=jpeg","description":"Amy Gutmann, who is currently the University of Pennsylvania's president, is the daughter of a Holocaust survivor who fled Nazi Germany in 1934.","source":{"name":"Business Insider","id":"business-insider"},"title":"Biden has chosen the daughter of a Holocaust survivor to be US ambassador to Germany","url":"https://www.businessinsider.com/biden-picks-amy-gutmann-holocaust-survivor-daughter-germany-ambassador-2021-7","content":"President Joe Biden announced on Friday that he was nominating Amy Gutmann to serve as US ambassador to Germany.\r\nGutmann, who is the president of the University of Pennsylvania, is also the daughter… [+1590 chars]"}]