[{"publishedAt":"2021-06-23T17:43:52Z","author":"Nina Golgowski","urlToImage":"https://img.huffingtonpost.com/asset/60d3494f410000a12b817258.jpeg?cache=kmf2wd77pw&ops=1778_1000","description":"The eight students claim the school's requirement violates their constitutional rights and the state's law against so-called vaccine passports.","source":{"name":"HuffPost","id":null},"title":"Indiana Students Sue University Over COVID-19 Vaccine Mandate","url":"https://www.huffpost.com/entry/indiana-university-students-sue-covid-vaccine-requirement_n_60d31f16e4b0c101fc82ce71","content":"Eight students at Indiana University have filed a lawsuit against the school over a mandatory coronavirus vaccine policy that they say is unconstitutional and a violation of a state law barring so-ca… [+3588 chars]"},{"publishedAt":"2021-06-17T13:03:46Z","author":"Hartley Charlton","urlToImage":"https://images.macrumors.com/t/YHh0eMXfMPRJ44EQ1xr7xuqDEmI=/1600x/https://images.macrumors.com/article-new/2021/02/apple-racial-equity-and-justice.jpg","description":"Apple has today announced that it is awarding \"innovation grants\" worth five million dollars to four historically black colleges and universities (HBCU), according to USA Today.\n\n\n\n\n\nAlabama A&M University, Howard University, Morgan State University, and Prai…","source":{"name":"MacRumors","id":null},"title":"Apple Awarding $5 Million 'Innovation Grants' to Four Historically Black Colleges and Universities","url":"https://www.macrumors.com/2021/06/17/apple-awarding-grants-to-black-universities/","content":"Apple has today announced that it is awarding \"innovation grants\" worth five million dollars to four historically black colleges and universities (HBCU), as reported by USA Today.\r\nAlabama A&amp;M Un… [+1504 chars]"},{"publishedAt":"2021-06-21T08:13:00Z","author":"Mairem Del Río","urlToImage":"https://assets.entrepreneur.com/content/3x2/2000/1624047165-Jun18DendaecommercesustentableDirkVanNieveltemprendedormochilero.jpg","description":"He went from backpacking to entrepreneur after leaving university to travel the world looking for his true self, but what he found was the path to success in sustainable business.","source":{"name":"Entrepreneur","id":null},"title":"At age 21, he went backpacking to find himself and ended up founding one of the largest sustainable startups in Latin America.","url":"https://www.entrepreneur.com/article/375116","content":"This article was translated from our Spanish edition using AI technologies. Errors may exist due to this process.\r\nOpinions expressed by Entrepreneur contributors are their own.\r\nThere are many ways … [+8088 chars]"},{"publishedAt":"2021-06-10T07:00:08Z","author":"Valeriya Safronova","urlToImage":"https://static01.nyt.com/images/2021/06/10/fashion/10PHEXXI1/10PHEXXI1-facebookJumbo.jpg","description":"Saundra Pelletier is marketing a new form of birth control to women wary of hormones.","source":{"name":"New York Times","id":null},"title":"What is the Phexxi Birth Control Method, and Who Owns It?","url":"https://www.nytimes.com/2021/06/10/style/what-is-phexxi.html","content":"She spent afternoons playing Skat, a card game, with her mother and her mothers friends, who taught her aphorisms such as if someone shows you who they are, you should believe them or theres nothing … [+1569 chars]"},{"publishedAt":"2021-06-07T21:22:53Z","author":"Alisha Haridasani Gupta and Lalena Fisher","urlToImage":"https://static01.nyt.com/images/2021/06/07/us/0607-IHW-boarddiversity/0607-IHW-boarddiversity-facebookJumbo.jpg","description":"The latest version of a multiyear analysis of Fortune 100 and 500 companies found that white women made some gains but that true representation is decades away.","source":{"name":"New York Times","id":null},"title":"Surprise: Women and Minorities Are Still Underrepresented in Corporate Boardrooms","url":"https://www.nytimes.com/2021/06/07/us/women-minorities-underrepresented-corporate-boardrooms.html","content":"I.S.S., which didnt break down the data by gender, attributed the shift to the widespread racial justice protests last summer.\r\nEven before the protests, there was growing pressure for boardroom dive… [+1784 chars]"}]