[{"publishedAt":"2021-06-07T18:59:00Z","author":"Jennifer Gray","urlToImage":"https://www.ctvnews.ca/polopoly_fs/1.5459812.1623091782!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg","description":"A group of physicists from Iowa State University have finally proven that the 'most brilliant auroras are produced by powerful electromagnetic waves during geomagnetic storms,' according to a newly released study.","source":{"name":"Ctvnews.ca","id":null},"title":"The mysterious origin of the northern lights has been proven - CTV News","url":"https://www.ctvnews.ca/sci-tech/the-mysterious-origin-of-the-northern-lights-has-been-proven-1.5459807","content":"The aurora borealis, or northern lights, could easily be described as Earth's greatest light show. A phenomenon that's exclusive to the higher latitudes has had scientists in awe and wonder for centu… [+3985 chars]"},{"publishedAt":"2021-06-21T18:39:00Z","author":"Dania Nadeem","urlToImage":"https://static.reuters.com/resources/r/?m=02&d=20210621&t=2&i=1566472063&r=LYNXNPEH5K14B&w=800","description":"COVID-19 therapies made from a cocktail of two types of antibodies were effective against a wide range of variants of the coronavirus in a mice and hamster study, the Washington University School of Medicine in St. Louis reported on Monday.","source":{"name":"Reuters","id":"reuters"},"title":"Dual-antibody drugs effective against COVID-19 variants in animal study - Reuters","url":"https://www.reuters.com/article/us-health-coronavirus-study-antibodies-idUSKCN2DX257","content":"(Reuters) - COVID-19 therapies made from a cocktail of two types of antibodies were effective against a wide range of variants of the coronavirus in a mice and hamster study, the Washington Universit… [+2224 chars]"},{"publishedAt":"2021-06-24T15:04:00Z","author":"Ludwig Burger","urlToImage":"https://www.reuters.com/resizer/-_gjF6hzC6ntTu3VL4bLyHhBYLw=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/NKRP2P366ZP7HN3B6HUUCLK5LI.jpg","description":"Researchers at Oxford University said on Thursday they have developed a method to predict the efficacy of new COVID-19 vaccines based on a blood test, potentially offering a short-cut around massive clinical trials that are increasingly difficult to conduct.","source":{"name":"Reuters","id":"reuters"},"title":"Oxford researchers say they developed blood test predictor of vaccine efficacy - Reuters","url":"https://www.reuters.com/business/healthcare-pharmaceuticals/oxford-researchers-say-they-developed-blood-test-predictor-vaccine-efficacy-2021-06-24/","content":"A healthcare worker applies a dose of the AstraZeneca coronavirus disease (COVID-19) vaccine in a vaccination center in San Salvador, El Salvador, June 22, 2021. REUTERS/Jose CabezasFRANKFURT, June 2… [+2534 chars]"},{"publishedAt":"2021-06-04T17:35:23Z","author":"The Associated Press","urlToImage":"https://s.abcnews.com/images/GMA/200828_gma_roberts2_hpMain_16x9_992.jpg","description":"Jerry Falwell Jr. is asking a court in Virginia to dismiss the lawsuit Liberty University filed over his headline-grabbing departure last year as leader of the evangelical school","source":{"name":"ABC News","id":"abc-news"},"title":"Falwell: Liberty University lawsuit is excuse to shame him","url":"https://abcnews.go.com/Politics/wireStory/falwell-liberty-university-lawsuit-excuse-shame-78086763","content":"LYNCHBURG, Va. -- Jerry Falwell Jr. is asking a court in Virginia to dismiss a lawsuit Liberty University filed over his headline-grabbing departure last year as leader of the evangelical school his … [+1830 chars]"},{"publishedAt":"2021-06-05T23:50:21Z","author":"Robert D. McFadden","urlToImage":"https://static01.nyt.com/images/2020/01/14/obituaries/00Patterson-John1/00Patterson-John1-facebookJumbo.jpg","description":"He welcomed the Klan and refused to integrate schools, forging a path that would be followed by Gov. George C. Wallace.","source":{"name":"New York Times","id":null},"title":"John M. Patterson, Segregationist Alabama Governor, Dies at 99","url":"https://www.nytimes.com/2021/06/05/us/politics/john-patterson-dead.html","content":"John Malcolm Patterson was born in Goldville on Sept. 27, 1921, one of six children (two of whom would die in childhood) of Albert and Agnes (Benson) Patterson. His parents were schoolteachers, but h… [+2597 chars]"}]